# https://github.com/Homebrew/homebrew-bundle
# Always run 'brew update' before running 'brew bundle'
# 
# To keep this file in sync I'm avoiding to install with the `brew install` command, 
# instead I'm adding a row to this file and run 'brew bundle --global' to make sure it's working. 
# 
# It's not always easy to understand how the dsl is constructed without reading the code.
# I know people have asked for clarification in the documentation but it has not been 
# well received by {noname}. Haven't found any changelog either but heck, it's open source ;-)
#

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"            # cask drivers
tap "homebrew/cask-fonts"              # fonts  
tap "homebrew/cask-versions"           # alternate versions of Casks

### ---------------------------------------------------- ###
### Formulae                                             ###
### ---------------------------------------------------- ###

brew "bash" 
brew "bash-completion" 
brew "bat"                                          # a cat clone with syntax highlighting and git integration
brew "brew-cask-completion" 
brew "ccat"                                         # colorizing cat  
brew "clair-scanner"                                # scan local docker images
brew "cloc"                                         # count lines of code  
brew "ctop"                                         # top-like interface for container metrics  
brew "curl"                                         # curl
brew "dfc"                                          # displays file system space usage using graphs and colors
brew "fzf"                                          # a command-line fuzzy finder
brew "go"                                           # golang sdk
brew "ghq"                                          # git remote repository management made easy
brew "gibo"                                         # easily accessing gitignore boilerplates
brew "git"                                          # cli client for git
brew "git-secret"                                   # scan git commits for secrets and credentials
brew "gnupg"                                        # gpg
brew "gron"                                         # make JSON greppable!
brew "htop"                                         # an interactive process viewer for Unix
brew "httpie"                                       # HTTP command-line client
brew "icdiff"                                       # improved colored diff
brew "jenv"                                         # manage your java environment
brew "jq"                                           # command-line JSON processor, like sed
brew "kompose"                                      # a conversion tool to go from Docker Compose to Kubernetes
brew "kubectl"                                      # kubernetes controller
brew "kubectx"                                      # kubectx: manage and switch between kubectl contexts, kubens: switch between Kubernetes namespaces.
brew "kubernetes-helm"                              # helm packagemanager for kubernetes
brew "kubespy"                                      # observing Kubernetes resources in real time
brew "mackup"                                       # keep application settings in sync 
brew "maven-completion"                   
brew "mas"                                          # Mac App Store command-line interface
brew "node"                                         # node.js
brew "plantuml"                                     # draw UML diagrams
brew "pip-completion"                   
brew "python"                                       # python programming
brew "reattach-to-user-namespace"                   # Reattach process (e.g., tmux) to background
brew "rest-shell"                                   # Spring HATEOAS-compliant REST shell
brew "ruby"                                         # ruby environment
brew "tig"                                          # text-mode interface for git
brew "tldr"                                         # Simplified and community-driven man pages (https://tldr.sh/)
brew "tmux"                                         # terminal multiplexer
brew "tree"                                         # list contents of directories in a tree-like format
brew "vim"                                          # highly configurable text editor
brew "watch"                                        # execute a program periodically and watch the output
brew "wget"                                         # non-interactive network downloader
brew "zsh"                                          # shell 

### ---------------------------------------------------- ###
### Casks (https://formulae.brew.sh/cask/)               ###
### ---------------------------------------------------- ###
# Note: Casks with version 'latest' will not be updated due to no checksum change
cask "java"                                         # java 
cask "alfred"                                       # a must have for boost productivity 
cask "arq"                                          # backup for mac
cask "backuploupe"                                  # browse your timemachine backups
cask "brave-browser"                                # privacy focused, performance oriented browser
cask "dbvisualizer"                                 # universal database tool (skip Java deps, we will use sdkman for Java)
cask "docker"                                       # docker for mac
brew "docker-completion"                            # docker completion
brew "docker-compose-completion"                    # docker compose completion
cask "dropbox"                                      # personal cloud storage service 
cask "gitkraken"                                    # Git GUI client for Windows, Mac and Linux 
cask "gitup"                                        # awesome Git Gui Client 
cask "google-chrome"                                # a browser 
cask "hammerspoon"                                  # powerful automation of MacOS, actions and wm
cask "intellij-idea"                                # awesome java IDE
cask "iterm2"                                       # Terminal emulator for macOS
cask "kdiff3"                                       # utility for comparing and merging files and directories
cask "minikube"                                     # kubernetes mini
cask "postman"                                      # nice rest client
cask "robo-3t"                                      # free lightweight GUI for MongoDB 
cask "sonos"                                        # Sonos controller
cask "spotify"                                      # music for everyone
cask "virtualbox"                                   # virtualizer for x86 hardware
cask "virtualbox-extension-pack" 
cask "visual-studio-code"                           # a great editor
cask "visualvm"                                     # visual profiling tool for the Java VM
cask "zoomus"                                       # video communications

## -- fonts                     
cask "font-fira-code"                               # monospaced font with programming ligatures

### ---------------------------------------------------- ###
### Mac App Store command line interface                 ###
### https://github.com/mas-cli/mas                       ###
### ---------------------------------------------------- ###

mas "Bredbandskollen", id: 1147976909
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353

